/*******************************************************************************
 * File Name:			CommParam.h 
 * Function Describe:	
 * Relate Module:		
 * Writer:				joneming
 * Date:				2012-09-08
 * Rewriter:
 * Date:		
 *******************************************************************************/
#ifndef _COMM_PARAM_H_
#define _COMM_PARAM_H_  

///////////////////////////////
/*************************************************************
** 函数名称: CommParamInit
** 功能描述: //串口初始化
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
*************************************************************/
void CommParamInit(void);
/*************************************************************
** 函数名称: CommParam_TimeTask
** 功能描述: 串口接收数据处理时间任务接口
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
**  备 注  :20毫秒调度1次
*************************************************************/
FunctionalState CommParam_TimeTask(void);
/*************************************************************
** 函数名称: CommParam_SendData
** 功能描述: 发送数据
** 入口参数: pBuffer源数据,BufferLen数据长度
** 出口参数: 无
** 返回参数: 0:成功；1:等待重发,2:失败,0xff:超出缓存长度
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char CommParam_SendData(unsigned char *pBuffer, unsigned short BufferLen);
/*************************************************************OK
** 函数名称: CommParam_CheckReadData
** 功能描述: 串口接收数据处理时间任务接口
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
**  备 注  :50毫秒调度1次
*************************************************************/
void CommParam_CheckReadData(void);

#endif//_CommParam_H_
/*******************************************************************************
 *                             end of module
 *******************************************************************************/
