/*******************************************************************************
 * File Name:			CommTest2.h 
 * Function Describe:	
 * Relate Module:		
 * Writer:				joneming
 * Date:				2012-09-08
 * Rewriter:
 * Date:		
 *******************************************************************************/
#ifndef _COMM_TEST2_H_
#define _COMM_TEST2_H_  
///////////////////////////////
/*************************************************************
** 函数名称: CommTest2Init
** 功能描述: //串口初始化
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
*************************************************************/
void CommTest2Init(void);
/*************************************************************
** 函数名称: CommTest2_TimeTask
** 功能描述: 串口接收数据处理时间任务接口
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
**  备 注  :20毫秒调度1次
*************************************************************/
FunctionalState CommTest2_TimeTask(void);
/*************************************************************
** 函数名称: CommTest2_SendData
** 功能描述: 发送数据
** 入口参数: pBuffer源数据,BufferLen数据长度
** 出口参数: 无
** 返回参数: 0:成功；1:等待重发,2:失败,0xff:超出缓存长度
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char CommTest2_SendData(unsigned char *pBuffer, unsigned short BufferLen);
/*************************************************************OK
** 函数名称: CommTest2_TimeTask
** 功能描述: 串口接收数据处理时间任务接口
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
**  备 注  :20毫秒调度1次
*************************************************************/
void CommTest2_CheckReadData(void);

#endif//_CommTest2_H_
/*******************************************************************************
 *                             end of module
 *******************************************************************************/
